<?php

	require_once 'func.php';

	$arr = [
		'Шрот' => [
			['                     Шрот                                              '],
			['мес/тон', 'Январь', 'Февраль', 'Август', 'Сентябрь', 'Октябрь', 'Ноябрь'],
			['25     ', ' 125  ', '  121  ', '  137 ', '  126   ', '  124  ', '  128 '],
			['50     ', ' 145  ', '  118  ', '  119 ', '  121   ', '  122  ', '  147 '],
			['75     ', ' 136  ', '  137  ', '  141 ', '  137   ', '  131  ', '  143 '],
			['100    ', ' 138  ', '  142  ', '  117 ', '  124   ', '  147  ', '  112 '],
		],

		'Жмых' => [
			['                         Жмых                                          '],
			['мес/тон', 'Январь', 'Февраль', 'Август', 'Сентябрь', 'Октябрь', 'Ноябрь'],
			['25     ', ' 121  ', '  137  ', '  124 ', '  137   ', '  122  ', '  125 '],
			['50     ', ' 118  ', '  121  ', '  145 ', '  147   ', '  143  ', '  145 '],
			['75     ', ' 137  ', '  124  ', '  136 ', '  143   ', '  112  ', '  136 '],
			['100    ', ' 142  ', '  131  ', '  138 ', '  112   ', '  117  ', '  138 '],
		],

		'Соя' => [
			['                         Соя                                           '],
			['мес/тон', 'Январь', 'Февраль', 'Август', 'Сентябрь', 'Октябрь', 'Ноябрь'],
			['25     ', ' 137  ', '  125  ', '  124 ', '  122   ', '  137  ', '  121 '],
			['50     ', ' 147  ', '  145  ', '  145 ', '  143   ', '  119  ', '  118 '],
			['75     ', ' 112  ', '  136  ', '  136 ', '  112   ', '  141  ', '  137 '],
			['100    ', ' 122  ', '  138  ', '  138 ', '  117   ', '  117  ', '  142 '],
		],
	];

	outputTabl($arr);

	$product = trim(readline('введите продукт: '));
	$month = trim(readline('введите месяц: '));
	$tonnage = trim(readline('введите тоннаж: '));


	if (array_key_exists($product, $arr)){
		$numMonth = array_search($month, $arr[$product][1]);
		$numTonnage = searchTonnage($arr[$product], $tonnage);		
	}

	if($numMonth && $numTonnage){
		echo 'Цена: ' . trim($arr[$product][$numTonnage][$numMonth]) . '000 руб';
	}else{
		echo 'Укажите параметры согласно таблице';
	}

?>